package day0302;
// 자바의 명명규칙(Naming Convention)

// 1. 공통규칙
// A. 자바는 대소문자를 엄격하게 구분하는 언어로써,
// 만약 대소문자가 다르면, 다른 존재이다.
// Ex03Naming ex03Naming
// B. 자바의 모든 것들은 _를 제외한 특수문자를
// 이름에 사용할 수 없다.

// C. 이름의 중간 혹은 끝에 숫자가 나올 수 있지만
// 시작할 때에는 숫자가 나올 수 없다.

// 그러한 명령어를 키워드라 칭하는데 이 키워드로는 이름을 지어줄 수 없다
// 따라서 이 50여개의 키워드를 암기해야만함
// 이클립스는 키워드를 자주색으로 표기함.

// 2. 낙타등 표기법(Camel Back Notation)
// 어떤이름이 여러개의 단어로 이루어 져 있을경우
// 단어간 구분을 쉽게하기위해 두번째 단어부터는 매 단어의 첫글자를
// 대문자로 기재하는 표기법을 말함
// playAndPlug

// 3. 뱀 표기법(Snake Notation)
// 모든 철자를 대문자로 적어주는 경우,
// 각 단어의 사이에 _를 넣어서 단어의 구분을 쉽게 할 수 있게 하는 표기법.

// 4. 여러가지 종류에 따른 명명 규칙
// A. 클래스의 이름은 대문자로 시작하고 낙타등 표기법을 사용하는 명사이다.
// B. 패키지의 이름은 소문자로 시작하고 명사를 사용하되, 해당 패키지 안에 있는
// 클래스들의 성격을 주로 한단어로 표현한다


public class Ex03Naming {

    public static void main(String[] args) {
        // TODO Auto-generated method stub

    }

}
